<?php

return [
    'site' => 'الموقع الإلكتروني',
    'config' => [
        'props' => [
            'public_view' => 'إظهار للعامة',
            'color_scheme' => 'نظام الألوان',
            'google_map_embed_url' => 'رابط تضمين خرائط جوجل',
        ],
    ],
    'page' => [
        'page' => 'الصفحة',
        'pages' => 'الصفحات',
        'module_title' => 'عرض جميع الصفحات',
        'module_description' => 'إدارة صفحات الموقع العامة',
        'props' => [
            'name' => 'اسم رابط التنقل',
            'title' => 'العنوان',
            'slug' => 'الرابط اللطيف',
            'sub_title' => 'العنوان الفرعي',
            'content' => 'المحتوى',
            'cta' => 'دعوة لاتخاذ إجراء',
            'cta_title' => 'عنوان الدعوة',
            'cta_description' => 'وصف الدعوة',
            'cta_button_text' => 'نص زر الدعوة',
            'cta_button_link' => 'رابط زر الدعوة',
        ],
    ],
    'seo' => [
        'seo' => 'تحسين محركات البحث',
        'is_public' => 'عام',
        'slug' => 'الرابط اللطيف',
        'meta_title' => 'عنوان الميتا',
        'meta_description' => 'وصف الميتا',
        'meta_keywords' => 'كلمات الميتا المفتاحية',
        'robots' => 'السماح لمحركات البحث باكتشاف الصفحة',
    ],
    'assets' => [
        'cover' => 'الغلاف',
        'og' => 'OG',
        'custom_og' => 'صورة OG مخصصة',
        'og_info' => 'ارفع صورة OG بمقاس 600×315 لاستخدامها عند مشاركة الصفحة على وسائل التواصل الاجتماعي.',
    ],
];
